In [1]:
import pandas as pd

In [2]:
path = "/Volumes/home/project/neurobiology/zimmer/ulises/active_sensing/lisa/20230502/data/worm1/beads_coords_after.csv"

In [6]:
df = pd.read_csv(path)
df.head()

   Unnamed: 0    0            1            2
0           0  5.0   334.329614   857.248431
1           1  5.0   314.846204  1040.949155
2           2  5.0  1102.532644  1764.618676
3           3  5.0  1876.302363   907.348628
4           4  5.0  1113.666021   147.495631

In [7]:
df = pd.read_csv(path, index_col=0)
df.head()

     0            1            2
0  5.0   334.329614   857.248431
1  5.0   314.846204  1040.949155
2  5.0  1102.532644  1764.618676
3  5.0  1876.302363   907.348628
4  5.0  1113.666021   147.495631

In [8]:
df = pd.read_csv(path, index_col=0, header=None)
df.head()

       1            2            3
0
NaN  0.0     1.000000     2.000000
0.0  5.0   334.329614   857.248431
1.0  5.0   314.846204  1040.949155
2.0  5.0  1102.532644  1764.618676
3.0  5.0  1876.302363   907.348628

In [9]:
df = pd.read_csv(path, index_col=0, header=0)
df.head()

     0            1            2
0  5.0   334.329614   857.248431
1  5.0   314.846204  1040.949155
2  5.0  1102.532644  1764.618676
3  5.0  1876.302363   907.348628
4  5.0  1113.666021   147.495631

In [3]:
# #
df = pd.read_csv(path, index_col=0)
df.head()

df.columns
print(len(df.columns))

3

In [4]:
df.head()

     0            1            2
0  5.0   334.329614   857.248431
1  5.0   314.846204  1040.949155
2  5.0  1102.532644  1764.618676
3  5.0  1876.302363   907.348628
4  5.0  1113.666021   147.495631